
&НаСервере
Процедура СформироватьНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Отчет");

	СхемаКомпоновкиДанных = ОбъектЗначение.ПолучитьМакет("Макет");
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
		
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ОсновныеДанные = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ОсновныеДанные);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   
	Запрос = Новый ЗАпрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_НомераПачек.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._НомераПачек КАК _НомераПачек
	|ГДЕ
	|	_НомераПачек.Владелец = &Владелец
	|	И _НомераПачек.Код = &Код";        
	Отчет.ТЧ.Очистить();
	Для каждого СтрокаТЧ из ОсновныеДанные Цикл
		Если СтрДлина(СтрокаТЧ.КодКСУ) < МинимальноеКоличествоСимволов Тогда
			Продолжить;
		КонецЕсли; 
		Если СкладОтделенТире Тогда
			Если СтрНайти(СтрокаТЧ.КодКСУ,"-") > 0 Тогда
				ЧастьСклада = Лев(СтрокаТЧ.КодКСУ,СтрНайти(СтрокаТЧ.КодКСУ,"-")-1);	
				ЧастьБезСклада = Сред(СтрокаТЧ.КодКСУ,СтрДлина(ЧастьСклада)+2);
				ПредполагаемаяПачка = Лев(ЧастьБезСклада,2);
				ОстальнаяЧасть = Сред(ЧастьБезСклада,3);
	           	НоваяСтрокаТЧ = Отчет.ТЧ.Добавить();   
				НоваяСтрокаТЧ.КодКСУ = СтрокаТЧ.КодКСУ; 
				НоваяСтрокаТЧ.ЧастьСтрокиСклада = ЧастьСклада;    
				НоваяСтрокаТЧ.ЧастьСтрокиПачки = ПредполагаемаяПачка; 
				НоваяСтрокаТЧ.ОстальнаяЧасть = ОстальнаяЧасть;   
				Склад = Справочники.Склады.НайтиПоРеквизиту("_КодСклада",ЧастьСклада); 
				НоваяСтрокаТЧ.НайденныйСклад = Склад;   
				Запрос.УстановитьПараметр("Владелец",Склад);
				Запрос.УстановитьПараметр("Код",ПредполагаемаяПачка);
	          	Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НоваяСтрокаТЧ.НайденнаяПачка = Выборка.Ссылка;  
					НоваяСтрокаТЧ.Отметка = Истина;
				КонецЕсли;
				НоваяСтрокаТЧ.Серия = СтрокаТЧ.Серия;   		
			КонецЕсли;
		Иначе
			Если СтрНайти(СтрокаТЧ.КодКСУ,"-") > 0 Тогда
				ЧастьСклада = Лев(СтрокаТЧ.КодКСУ,СтрНайти(СтрокаТЧ.КодКСУ,"-")-1);	
				ЧастьБезСклада = Сред(СтрокаТЧ.КодКСУ,СтрДлина(ЧастьСклада)+2);
				ПредполагаемаяПачка = Лев(ЧастьБезСклада,2);
				ОстальнаяЧасть = Сред(ЧастьБезСклада,3);
	           	НоваяСтрокаТЧ = Отчет.ТЧ.Добавить();   
				НоваяСтрокаТЧ.КодКСУ = СтрокаТЧ.КодКСУ; 
				НоваяСтрокаТЧ.ЧастьСтрокиСклада = ЧастьСклада;    
				НоваяСтрокаТЧ.ЧастьСтрокиПачки = ПредполагаемаяПачка; 
				НоваяСтрокаТЧ.ОстальнаяЧасть = ОстальнаяЧасть;   
				Склад = Справочники.Склады.НайтиПоРеквизиту("_КодСклада",ЧастьСклада); 
				НоваяСтрокаТЧ.НайденныйСклад = Склад;   
				Запрос.УстановитьПараметр("Владелец",Склад);
				Запрос.УстановитьПараметр("Код",ПредполагаемаяПачка);
	          	Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НоваяСтрокаТЧ.НайденнаяПачка = Выборка.Ссылка;  
					НоваяСтрокаТЧ.Отметка = Истина;
				КонецЕсли;
				НоваяСтрокаТЧ.Серия = СтрокаТЧ.Серия;   
			Иначе
				
				ЧастьСклада = Лев(СтрокаТЧ.КодКСУ,КоличествоСимволовСклада );	
				ЧастьБезСклада = Сред(СтрокаТЧ.КодКСУ,КоличествоСимволовСклада+1);
				ПредполагаемаяПачка = Лев(ЧастьБезСклада,2);
				ОстальнаяЧасть = Сред(ЧастьБезСклада,3);
	           	НоваяСтрокаТЧ = Отчет.ТЧ.Добавить();   
				НоваяСтрокаТЧ.КодКСУ = СтрокаТЧ.КодКСУ; 
				НоваяСтрокаТЧ.ЧастьСтрокиСклада = ЧастьСклада;    
				НоваяСтрокаТЧ.ЧастьСтрокиПачки = ПредполагаемаяПачка; 
				НоваяСтрокаТЧ.ОстальнаяЧасть = ОстальнаяЧасть;   
				Склад = Справочники.Склады.НайтиПоРеквизиту("_КодСклада",ЧастьСклада); 
				НоваяСтрокаТЧ.НайденныйСклад = Склад;   
				Запрос.УстановитьПараметр("Владелец",Склад);
				Запрос.УстановитьПараметр("Код",ПредполагаемаяПачка);
	          	Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НоваяСтрокаТЧ.НайденнаяПачка = Выборка.Ссылка;  
					НоваяСтрокаТЧ.Отметка = Истина;
				КонецЕсли;
				НоваяСтрокаТЧ.Серия = СтрокаТЧ.Серия;  
				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)  
	Элементы.Страницы.ТекущаяСтраница = Элементы.Данные;
	СформироватьНаСервере();
КонецПроцедуры

// Обработка
&НаСервере                               
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	МинимальноеКоличествоСимволов = 8;  
	КоличествоСимволовСклада = 3;  
	СкладОтделенТире = Истина;
	//ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПачкуВСерииНаСервере()  
	Колво = 0;   
	Ошибки = "Не удалось изменить серии:";
	БылиОшибки = Ложь;
	Для каждого СтрокаТЧ из Отчет.ТЧ Цикл
		Если СтрокаТЧ.Отметка и ЗначениеЗаполнено(СтрокаТЧ.НайденнаяПачка) Тогда    
			Попытка 
				СерияОбъект = СтрокаТЧ.Серия.ПолучитьОбъект();
				СерияОбъект._НомерПачки = СтрокаТЧ.НайденнаяПачка;
				СерияОбъект.ЗАписать();
				Колво = Колво + 1;    
			Исключение  
				Ошибки = Ошибки + Символы.ПС + Строка(СтрокаТЧ.Серия);
				БылиОшибки = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;               
	Сообщить("Количество измененных серий - " + Строка(Колво));    
	Если БылиОшибки Тогда Сообщить(Ошибки); КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПачкуВСерии(Команда)
	ЗаполнитьПачкуВСерииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура кнУбратьВсе(Команда)
	Для каждого СтрокаТЧ из Отчет.ТЧ Цикл 
		СтрокаТЧ.Отметка = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура кнУстановитьВсе(Команда)
	Для каждого СтрокаТЧ из Отчет.ТЧ Цикл 
		СтрокаТЧ.Отметка = Истина;	
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЛоготипНажатие(Элемент)
	ОткрытьСправку(ПолучитьПолноеИмяОбъекта());
КонецПроцедуры

&НаСервере
Функция ПолучитьПолноеИмяОбъекта()
	Возврат "ВнешнийОтчет.ЗаполнениеСерийПачками";
КонецФункции

