                                            Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеОбъекта = ЭтотОбъект.Метаданные();
	
	Информация = "";
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");  // дополнительныйотчёт
	РегистрационныеДанные.Вставить("Наименование", МетаданныеОбъекта.Представление());
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", Информация);
	ТЗКоманды = Новый ТаблицаЗначений;
	ТЗКоманды.Колонки.Добавить("Идентификатор");
	ТЗКоманды.Колонки.Добавить("Представление");
	ТЗКоманды.Колонки.Добавить("Модификатор");
	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманды.Колонки.Добавить("Использование");    
	СтрокаКоманды = ТЗКоманды.Добавить();
	СтрокаКоманды.Представление = МетаданныеОбъекта.Представление();
	СтрокаКоманды.ПоказыватьОповещение = Ложь;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	СтрокаКоманды.Идентификатор = МетаданныеОбъекта.Имя;
	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);    
	Возврат РегистрационныеДанные;
	
КонецФункции
